Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала >= ДатаОкончания Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТекЛига			= ОбъектКопирования.Владелец;
	ЧемпионатЛигиПоследний = СерверныйФункции.ЧемпионатЛигиПоследний(ТекЛига);
	Наименование	= "";
	нГод			= 0;
	Слова			= Разделить(Строка(ЧемпионатЛигиПоследний));
	Для Каждого Слово Из Слова Цикл
		Если СтрНайти("0123456789", Лев(Слово, 1)) > 0 Тогда
			нГод = СтрокаКакЧисло(Лев(Слово, 4)) + 1;
			Прервать;
		Иначе
			Наименование = Наименование + Слово + " ";
		КонецЕсли;
	КонецЦикла;
	
	Наименование = Наименование + ?(нГод = 0,
		Формат(Год(ТекущаяДата()), "ЧГ=0") + "/" + Формат((Год(ТекущаяДата()) + 1) - Цел((Год(ТекущаяДата()) + 1) / 100) * 100, "ЧН=00"),
		Формат(нГод, "ЧГ=0") + "/" + Прав(Формат(нГод + 1, "ЧГ=0"), 2));
	
	ДатаНачала		= ДобавитьМесяц(?(нГод = 0, ДатаНачала, ЧемпионатЛигиПоследний.ДатаНачала), 12);
	ДатаОкончания	= ДобавитьМесяц(?(нГод = 0, ДатаОкончания, ЧемпионатЛигиПоследний.ДатаОкончания), 12);
	
	Команды.Очистить();
	Шаг		= 0;
	Выборка	= СерверныйФункции.ТурнирнаяТаблица(ЧемпионатЛигиПоследний);
	Пока Выборка.Следующий() И Шаг < ТекЛига.КоличествоКоманд - ТекЛига.КоличествоРотация Цикл
		ЗаполнитьЗначенияСвойств(Команды.Добавить(), Выборка);
		
		Шаг = Шаг + 1;
	КонецЦикла;
	Команды.Сортировать("Команда");
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Команды.Свернуть("Команда");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Лига") Тогда
		ОлимпийскаяСистема	= ДанныеЗаполнения.ОлимпийскаяСистема;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Владелец") Тогда
			ОбработкаЗаполнения(ДанныеЗаполнения.Владелец, ТекстЗаполнения, Ложь);
		//Если ТипЗнч(ДанныеЗаполнения.Свойство("Владелец")) = Тип("СправочникСсылка.Лига") Тогда
		//	ОлимпийскаяСистема	= ДанныеЗаполнения.Владелец.ОлимпийскаяСистема;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
